Autodesk.Revit.DB.InternalDefinition
This object represents a parameter definition in Autodesk Revit.
Every parameter has a ParamDef object which defines what kind of parameter it is, its properties, its behavior, etc.
The ParamDef class is a base class with various derived classes representing different kinds of parameters.
ParamDefs serve the following purposes:
Basic properties : name, ID, the group it appears in (in the UI), whether it is read only, etc.
Formatting and parsing : converting values to and from display strings, implemented by subclasses.
Defining the kind of parameter : the kind of data the parameter represents: length, text, material, level, etc.
Defining the UI for the parameter : together with the corresponding ParameterUI subclass,
determines what kind of control will be used for the parameter in properties grids: edit box, combo box, pushbutton, etc.